Sample SOAP Request XMLs/CostCenterRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tns="www.outoftheboxacademy.com">
    <soapenv:Header/>
    <soapenv:Body>
        <tns:CostCenterRequest>
            <CostCenterID>CC-2001</CostCenterID>
        </tns:CostCenterRequest>
    </soapenv:Body>
</soapenv:Envelope>
